- Pandas의 꽃, 그룹별 연산을 위한 groupby 메서드

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

In [2]:
df=sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
# 성별에 따른 생존율 평균 구하기
df.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [4]:
# 성별과 등급에 따른 생존율 평균 구하기
df.groupby(['sex', 'class'])['survived'].mean()

C:\Users\KDP-50\AppData\Local\Temp\ipykernel_7772\1969562835.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex', 'class'])['survived'].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [5]:
# agg 메서드 사용하기
df.groupby(['sex', 'class'])['survived'].agg(['mean', 'count'])

C:\Users\KDP-50\AppData\Local\Temp\ipykernel_7772\904373361.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex', 'class'])['survived'].agg(['mean', 'count'])

                   mean  count
sex    class
female First   0.968085     94
       Second  0.921053     76
       Third   0.500000    144
male   First   0.368852    122
       Second  0.157407    108
       Third   0.135447    347

In [6]:
# agg 메서드 사용하기 (열 별로 다른 연산 사용하기)
df.groupby(['sex', 'class'])[['survived', 'age']].agg({'survived':'mean', 'age':'max'})

C:\Users\KDP-50\AppData\Local\Temp\ipykernel_7772\1320653008.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex', 'class'])[['survived', 'age']].agg({'survived':'mean', 'age':'max'})

               survived   age
sex    class
female First   0.968085  63.0
       Second  0.921053  57.0
       Third   0.500000  63.0
male   First   0.368852  80.0
       Second  0.157407  70.0
       Third   0.135447  74.0

In [7]:
# 사용자 정의함수 get_IQR
# 승객 성별과 좌석 등급 그룹별 데이터의
# 제3분위수와 제 1분위수의 차이 구하기
def get_IQR(data):
    _3rd=data.quantile(.75)
    _1rd=data.quantile(.25)
    return (np.abs(_3rd-_1rd))*1.5

In [8]:
df.groupby(['sex', 'class'])['age'].apply(get_IQR)

C:\Users\KDP-50\AppData\Local\Temp\ipykernel_7772\2281141909.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(['sex', 'class'])['age'].apply(get_IQR)

sex     class
female  First     31.5000
        Second    20.6250
        Third     23.4375
male    First     31.5000
        Second    20.6250
        Third     19.5000
Name: age, dtype: float64

In [9]:
# penguins 데이터 가져오기
df2=sns.load_dataset('penguins')

In [10]:
# penguins 데이터의 결측치 확인
df2.isna().sum()

species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
dtype: int64

In [11]:
# sex열을 제외한 나머지 열들의 결측치 groupby로 구하기
# 해당 열들의 평균값 구하기
df2.groupby('species')[['bill_length_mm', 'bill_depth_mm', 'flipper_length_mm', 'body_mass_g']].mean()

           bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
species
Adelie          38.791391      18.346358         189.953642  3700.662252
Chinstrap       48.833824      18.420588         195.823529  3733.088235
Gentoo          47.504878      14.982114         217.186992  5076.016260

In [12]:
# apply 메서드와 lambda 함수 사용하여 결측치 채우기
df2.groupby('species')[['bill_length_mm', 'bill_depth_mm', 'flipper_length_mm', 'body_mass_g']].apply(lambda x: x.fillna(x.mean()))

             bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
species
Adelie  0         39.100000      18.700000         181.000000  3750.000000
        1         39.500000      17.400000         186.000000  3800.000000
        2         40.300000      18.000000         195.000000  3250.000000
        3         38.791391      18.346358         189.953642  3700.662252
        4         36.700000      19.300000         193.000000  3450.000000
...                     ...            ...                ...          ...
Gentoo  339       47.504878      14.982114         217.186992  5076.016260
        340       46.800000      14.300000         215.000000  4850.000000
        341       50.400000      15.700000         222.000000  5750.000000
        342       45.200000      14.800000         212.000000  5200.000000
        343       49.900000      16.100000         213.000000  5400.000000

[344 rows x 4 columns]

In [13]:
df3 = pd.DataFrame({'group':['A','A','A','B','B'], 'value':[1,1,1,10,10]})
df3

  group  value
0     A      1
1     A      1
2     A      1
3     B     10
4     B     10

In [14]:
groupObj=df3.groupby('group')
groupObj['value'].sum()

group
A     3
B    20
Name: value, dtype: int64

- 데이터셋에서 0~1번 행과 2~4번 행을 그룹으로 하여 'value'의 합 구하기

In [15]:
groupObj2=df3.groupby([0,0,1,1,1])
groupObj2['value'].sum()

0     2
1    21
Name: value, dtype: int64

In [16]:
s=pd.Series([False, False, True, True, True])
df3.groupby(s)['value'].sum()

False     2
True     21
Name: value, dtype: int64